{
  "Chocolate mint Aero trifle": {
    "ingredients": {
      "main": [
        "600g pkt bought dark chocolate mud cake, icing removed",
        "450g double thick custard",
        "250g mascarpone",
        "3 x 118g Aero Mint chocolate blocks, plus extra, to decorate",
        "Darrell Lea chocolate mint balls, to decorate",
        "Peppermint crisps, to decorate",
        "Candy canes, to decorate"
      ],
      "CHOCOLATE SAUCE": ["150ml pouring cream", "150g dark chocolate, chopped"],
      "CHOCOLATE MOUSSE": [
        "200g dark chocolate",
        "40g unsalted butter",
        "2 eggs, separated",
        "2 tbsp caster sugar",
        "300ml carton thickened cream"
      ],
      "CHOC MINT CREAM": [
        "600ml carton thickened cream",
        "70g (1/3 cup) caster sugar",
        "1 tsp peppermint extract",
        "Green liquid food colouring, to tint"
      ]
    },
    "methods": {
      "Step 1": "To make the chocolate sauce, combine creamUnsure of the quantity needed?Click on the underlined ingredient to reveal the quantity. No need to flip back and forth!OK, Got It (150ml pouring cream) and chocolate (150g dark chocolate, chopped) in a small saucepan. Cook, stirring, over low heat for 5 minutes or until melted. Set aside to cool.",
      "Step 2": "Cut the cake (600g pkt bought dark chocolate mud cake, icing removed) in half horizontally. Cut each half into 2cm-thick strips. Place half the cake strips in a layer over the base of a 3L (12-cup) trifle bowl. Drizzle with half the chocolate sauce. Set aside.",
      "Step 3": "Place the custard (450g double thick custard) in a mixing bowl. Add a few drops of food colouring (Green liquid food colouring, to tint). Stir to combine. Add the mascarpone (250g mascarpone). Use electric beaters to beat the mixture until thickened. Spread evenly over the chocolate sauce. Place in the fridge for 30 minutes to set. Top with remaining chocolate cake.",
      "Step 4": "To make the chocolate mousse, place the dark chocolate (200g dark chocolate) and butter (40g unsalted butter) in a heatproof bowl over a saucepan of simmering water (make sure the bowl doesn’t touch the water). Stir occasionally until smooth. Set aside for 5 minutes to cool slightly. Place the egg whites (2 eggs, separated) in a clean, dry bowl. Use clean electric beaters to beat the egg white and sugar (2 tbsp caster sugar) until soft peaks form. Stir the egg yolk into the chocolate mixture. (Don’t overmix or the chocolate will harden and set). Fold the egg white, in batches, into the chocolate mixture. Use clean electric beaters to beat the cream (600ml carton thickened cream) in a bowl until soft peaks form. Gently fold the cream into the chocolate mixture until just combined.",
      "Step 5": "Use a small, serrated knife to cut 2 chocolate blocks into squares. Arrange the chopped chocolate on the cake at an angle against the glass. (You will need to prop up the first piece with some chocolate as support). Sprinkle any leftover and broken pieces of chocolate in the centre. Spoon chocolate mousse evenly over the chocolate layer. Smooth the surface. Place in the fridge for 30 minutes until just set.",
      "Step 6": "To make the chocolate mint cream, use electric beaters to beat the cream, sugar (70g (1/3 cup) caster sugar) and peppermint extract (1 tsp peppermint extract) in a bowl until soft peaks form. Add a few drops of food colouring and fold to combine.",
      "Step 7": "Spread the mint cream over the top of the trifle. Place in the fridge for 3 hours to set.",
      "Step 8": "Drizzle the trifle with some of the remaining chocolate sauce. (You may need to microwave it on Low, briefly, if it has set). Use a serrated knife to thinly slice the remaining chocolate block. Arrange chocolate, sliced peppermint crisp, chocolate mint balls and candy canes over the top of the trifle. Serve any remaining sauce with the trifle."
    }
  }
}
